---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyInt64
source: html/facbb925-a9de-9a85-2bcd-5d7364fbedbc.htm
---
# AssetPropertyInt64 Members

Adds a new connected asset attached to this asset property, if it allows it.